import React from 'react';

const About = () => {
  return (
    <div className="mt-5 bg-warning text-white p-5 fs-5">
      <p>
        <b>Блог</b> (англ. blog, от <i>web log</i> — интернет-журнал событий, интернет-дневник, онлайн-дневник) — веб-сайт, основное
        содержимое которого — регулярно добавляемые пользователем записи, содержащие текст, изображения или мультимедиа.
        Для блогов характерна возможность публикации отзывов (комментариев) посетителями; она делает блоги средой сетевого общения,
        имеющей ряд преимуществ перед электронной почтой, группами новостей и чатами.
      </p>
      <p>Людей, ведущих блог, называют бло́герами. Совокупность всех блогов Сети принято называть блогосферой.</p>
      <p>
        Первым блогом считается страница Тима Бернерса-Ли, где он, начиная с 1992 г., публиковал новости.
        Более широкое распространение блоги получили с 1996 г.
        В августе 1999 г. компьютерная компания Pyra Labs из Сан-Франциско открыла сайт Blogger.com, который стал первой бесплатной блоговой службой.
      </p>
      <p>
        В настоящее время особенность блогов заключается не только в структуре записей, но и в простоте добавления новых записей.
        Пользователь просто обращается к веб-серверу, проходит процесс идентификации пользователя, после чего он добавляет новую запись к своей коллекции.
        Сервер представляет информацию как последовательность сообщений, помещая в самом верху самые свежие сообщения.
        Структура коллекции напоминает привычную последовательную структуру дневника или журнала.
      </p>
    </div>
  );
};

export default About;